Endeksi alfabenin ilk 10 harfi olan ve ilk 10 asal sayıyı ve ilk 10 fibonacci sayısını içeren bir veri çerçevesi oluşturun.

In [7]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')


alfabe = ["A", "B", "C", "Ç", "D", "E", "F", "G", "Ğ", "H"]
sayilar = pd.DataFrame(index=alfabe)
sayilar.index.name = 'Sıra'
sayilar['Asal'] = ['2', '3', '5', '7', '11', '13', '17', '19', '23', '29']
sayilar['Fibonacci'] = ['1', '1', '2', '3', '5', '8', '13', '21', '34', '55']

sayilar

     Asal Fibonacci
Sıra
A       2         1
B       3         1
C       5         2
Ç       7         3
D      11         5
E      13         8
F      17        13
G      19        21
Ğ      23        34
H      29        55

Kaggle'dan Titanic: Machine Learning from Disaster isimli yarışmanın train.csv isimli dosyasını indirin ve Pandas veri çerçevelerini kullanarak tüm veriyi yükleyin. Veri çerçevelerinin .groupby() metodunu kullanarak yolcuların ortalama yaşlarını herbir cinsiyet için ayrı olacak şekilde hesaplayın.

In [78]:
titanic = pd.read_csv('train.csv',index_col=0)
titanic.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [79]:
titanic.groupby(by='Sex').mean()['Age']

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

Koşullu seçim yöntemlerini de kullanarak, 30 yaşından küçük tüm yolcuların kurtulma oranını (survival ratio) hesaplayın. Daha sonra, kurtulma oranını cinsiyete göre ayrı ayrı hesaplayın.

In [80]:
survival_ratio = len(titanic[(titanic ['Age'] <30)&(titanic['Survived']==1)]) / len(titanic) *100
survival_ratio

17.50841750841751

In [81]:
kadin_survival_ratio= len(titanic[(titanic['Sex'] == 'female')&(df['Survived']==1)])/len(titanic)*100
kadin_survival_ratio

13.580246913580247

In [82]:
erkek_survival_ratio= len(titanic[(titanic['Sex'] == 'male')&(df['Survived']==1)])/len(titanic)*100
erkek_survival_ratio

24.803591470258137